Revit 2027 API
RebarConstraint.GetDistanceToTargetHostEdge Method
 Returns the distance from the RebarConstrainedHandle to the target host edge. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' and must allow offset value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDistanceToTargetHostEdge()
Public Function GetDistanceToTargetHostEdge As Double
public:
double GetDistanceToTargetHostEdge()
member GetDistanceToTargetHostEdge : unit -> float
Return Value
Double
 Returns the distance from the RebarConstrainedHandle to the target host edge.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdge'. -or- The RebarConstrainedHandle doesn't allow distance for constraint of ToHostEdge or ToHostEdgeCover type.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace